[
    {
	"name": "FizzBuzz",
	"summary": "Fizz buzz (also known as bizz buzz, or simply buzz) is a group word game for children to teach them about division. Players take turns to count incrementally, replacing any number divisible by three with the word 'fizz', and any number divisible by five with the word 'buzz'",
	"href": "http://content.codersdojo.org/code-kata-catalogue/fizz-buzz/"
    },

    {
	"name": "Prime Factors",
	"summary": "Write a static method generate() that given an integer N will return a list of integers such that the numbers are the factors of N and are arranged in increasing numerical order. generate(1) should return an empty list. generate(30) should return the numbers 2,3,5."
    },

    {
	"name": "Roman Numerals",
	"summary": "Convert arabic numbers into roman numbers." ,
	"href": "http://content.codersdojo.org/code-kata-catalogue/roman_numerals/"
    },
    {
	"name": "Berlin Clock",
	"summary": "Create a representation of the Berlin Clock for a given time (hh::mm:ss).",
	"href": "http://content.codersdojo.org/code-kata-catalogue/berlin-clock/"
    },
    {
	"name": "Bowling Game",
	"summary": "Count and sum the scores of a bowling game of one player. A bowling game consists of 10 frames in which the player tries to knock down the 10 pins. In every frame the player can throw one or two times. The actual number depends on strikes and spares. The score of a frame is the number of knocked down pins plus bonuses for strikes and spares. After every frame the 10 pins are resettet.",
	"href": "http://content.codersdojo.org/code-kata-catalogue/bowling-game/"
    },
    {
	"name": "Red Pencil Promotion",
	"summary": "We provide a shopping portal, where dealers can offer their goods (similiar to Amazon market place). We want to support red pencil promotions for reduced prices. During the red pencil promotion the old price is crossed out in red and the new reduced price is written next to it.",
	"href": "http://content.codersdojo.org/code-kata-catalogue/red-pencil-promotion/"
    }

]

